{
  "id": "0b3e5490-1e59-4606-89bf-4b8f75b82304",
  "siteName": "skill flow",
  "domainUrl": "skillflowing.com",
  "brandingPresets": [
    {
      "presetId": "732f99d8-433f-4288-a5ed-4d4fab83a0dd",
      "brandIdentity": {
        "designSummary": "This brand design embraces a minimalist and modern aesthetic characterized by spacious layouts, clean typography, and a restrained pastel color palette. The primary background colors are soft off-whites and pale blues, creating a calm and inviting canvas. Text and interactive elements predominantly use a deep navy blue, ensuring strong contrast and readability. Accent colors in subtle pastel purple and yellow appear in small UI elements, adding gentle vibrancy without overwhelming the design. Typography is geometric sans-serif, with large, bold headings paired with lighter, well-spaced body text to enhance clarity and hierarchy. The layout employs modular grids with generous negative space, balancing text and iconography in a harmonious, user-friendly manner. Buttons are solid, rounded rectangles with dark backgrounds and white text, emphasizing clear calls to action. Overall, the design conveys professionalism, approachability, and efficiency, making it highly adaptable for educational platforms, professional services, and technology brands seeking a clean and trustworthy online presence.",
        "toneOfVoice": "Professional, approachable, clear, and trustworthy with a calm and efficient personality.",
        "tones": [
          "calm",
          "trustworthy",
          "professional",
          "clean",
          "modern",
          "approachable",
          "efficient",
          "minimal",
          "friendly",
          "balanced"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modernism"
          ],
          "supportingStyles": [
            "Flat Design",
            "Geometric"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#1E254E",
            "primaryForeground": "#F7F9FF",
            "secondary": "#A59FE6",
            "secondaryForeground": "#1E254E",
            "background": "#F7F9FF",
            "customColors": [
              {
                "name": "softyellowaccent",
                "value": "#FFF9B1"
              },
              {
                "name": "foreground",
                "value": "#1E254E"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the primary canvas for all pages to maintain a clean and calm atmosphere. The 'primary' color should be reserved for main text, headings, and key interactive elements such as buttons and links, paired with 'primaryForeground' for text on these elements to ensure readability. The 'secondary' color and its 'secondaryForeground' are ideal for subtle UI accents, secondary buttons, and category tags, providing gentle contrast without overpowering the primary content. Custom colors like 'softYellowAccent' and 'lightPurpleAccent' are best used sparingly for highlighting informational badges, icons, or subtle background gradients to add visual interest while preserving the minimalist tone. This palette ensures accessibility and visual harmony, supporting a professional and approachable brand presence.",
          "paletteAccessibilityNotes": "The 'primary' color (#1E254E) on 'background' (#F7F9FF) achieves excellent contrast exceeding WCAG AA standards for both normal and large text. Buttons using 'primary' with 'primaryForeground' (#FFFFFF) also meet AAA contrast requirements. The 'secondary' color (#A59FE6) on 'background' provides sufficient contrast for UI accents and secondary text, meeting WCAG AA for large text. Custom colors 'softYellowAccent' and 'lightPurpleAccent' are used in small UI elements and backgrounds where contrast requirements are less stringent but should be paired with 'primary' or 'primaryForeground' text to maintain readability and accessibility compliance."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "helvetica-w01-bold",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "rubik-v2",
              "poppins-v2",
              "open sans"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to establish clear content hierarchy. Headings should be large and bold with ample spacing to enhance readability and visual impact. Pair headings with the paragraph font to create a balanced typographic rhythm. Ensure headings use the 'primary' color for maximum contrast against the 'background'. Maintain consistent letter spacing and line height to preserve clarity across devices and screen sizes.",
            "headingsAccessibilityNotes": "Headings in 'primary' color on 'background' meet WCAG AAA contrast standards, ensuring excellent readability for all users."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "helvetica-w01-roman",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "rubik-v2",
              "open sans",
              "poppins-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body copy, descriptions, and supporting text. Maintain a lighter font weight and moderate size to ensure comfortable reading. Paragraph text should use the 'primary' color or a slightly lighter shade if needed for secondary information, always ensuring sufficient contrast with the 'background'. Combine with headings to create a clear typographic hierarchy and consistent user experience. Line height and letter spacing should be optimized for legibility on all screen sizes.",
            "paragraphsAccessibilityNotes": "Paragraph text in 'primary' color on 'background' meets WCAG AA contrast requirements for normal text, supporting accessibility and readability."
          },
          "welcomeSectionTypography": {
            "placement": "Bottom-Third Anchor",
            "implementation": "The welcome section typography is anchored in the bottom third of the layout, creating a grounded and approachable introduction. Large, bold headings occupy the lower left quadrant, balanced by supporting text and call-to-action buttons placed nearby with ample negative space. This placement draws the eye naturally from the headline to the action, leveraging the spacious layout and clean typography to create a welcoming and clear entry point for users."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.25",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.35",
              "letterSpacing": "0.015em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.005em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "-0.005em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.015em",
              "fontWeight": "800"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.02em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.025em",
              "fontWeight": "900"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.03em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.035em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.04em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use subtle rounded corners and light backgrounds with gentle shadows or borders to separate content blocks. They maintain consistent padding and spacing to preserve the clean and spacious feel. Background colors often use 'background' or custom pastel accents to differentiate sections without overwhelming the user.",
          "images": "Images are used sparingly and are well-integrated with text content, often aligned to the right or left of text blocks. They maintain natural proportions and are framed with generous white space to avoid clutter. Image treatments are minimal, focusing on clarity and relevance.",
          "buttons": "Buttons are solid with rounded corners, primarily using the 'primary' color for backgrounds and 'primaryForeground' for text. Secondary buttons use lighter backgrounds with 'secondary' color text and borders. Buttons have clear hover states and sufficient padding for easy interaction."
        },
        "graphicElements": {
          "icons": "Icons are minimalistic, line-based, and use the 'primary' or 'secondary' colors depending on context. They are small, simple, and consistent in style, supporting content without distraction.",
          "illustrations": "Illustrations are minimal or absent in the UI, with the design favoring photographic or video content where applicable. When present, they use the custom pastel colors to maintain harmony.",
          "stickers": "Stickers or badges are small, color-coded UI elements using 'softYellowAccent' or 'lightPurpleAccent' to categorize or highlight content. They have rounded corners and subtle shadows to stand out gently."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752409506686-Screenshot%202025-07-13%20at%2015.24.32.png"
      ]
    },
    {
      "presetId": "cb8e0452-ae91-4eda-9dc5-2eaad304dba7",
      "brandIdentity": {
        "designSummary": "The design features a modern dark mode aesthetic with a solid black background that creates a sleek and immersive environment. Vibrant neon green and bright blue accent colors energize the interface, highlighting interactive elements and branding. Typography is geometric, clean, and sans-serif, with large, bold headings that mix white and neon green to emphasize key messages. The layout is spacious and balanced, using a centered column grid with generous negative space and rounded corners on containers and buttons to soften the high-tech feel. The footer employs a modular grid with distinct colored blocks, maintaining visual consistency and clarity. Overall, the design conveys a cutting-edge, digital culture vibe suitable for a gaming or tech conference, combining high contrast, minimalism, and vibrant accents for a friendly yet professional look.",
        "toneOfVoice": "Futuristic, innovative, approachable, and tech-savvy with a casual yet professional personality.",
        "tones": [
          "Futuristic",
          "Innovative",
          "Energetic",
          "Casual",
          "Professional",
          "Tech-savvy",
          "Minimal",
          "High-contrast",
          "Clean",
          "Approachable"
        ],
        "designStyle": {
          "primaryStyle": [
            "Dark Mode",
            "Minimalism",
            "Techno-Futuristic"
          ],
          "supportingStyles": [
            "Geometric",
            "Modular",
            "Neon Accent"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#FFFFFF",
            "secondary": "#2B5FFF",
            "secondaryForeground": "#FFFFFF",
            "background": "#000000",
            "customColors": [
              {
                "name": "accentneongreen",
                "value": "#3EFFB8"
              },
              {
                "name": "accentpeach",
                "value": "#FFCCB3"
              },
              {
                "name": "foreground",
                "value": "#000000"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#ffffff"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' black color as the main background to create a sleek, immersive environment. The 'primaryForeground' white color is ideal for main text and icons to ensure maximum readability and contrast. The 'secondary' blue color should be used for branding elements such as color blocks,UI cards, repeters logos and footer backgrounds, paired with 'secondaryForeground' white for text and icons. The 'accentNeonGreen' color is reserved for interactive elements like buttons, badges, and icons to draw user attention and convey energy and innovation. The 'accentPeach' color provides a subtle warm contrast in secondary UI elements such as social media icon backgrounds, balancing the cool palette. Combine these colors thoughtfully to maintain high contrast and accessibility, ensuring that text and interactive elements stand out clearly against backgrounds.",
          "paletteAccessibilityNotes": "The combination of 'primaryForeground' white on 'primary' black background meets WCAG AAA contrast standards for text readability. The 'accentNeonGreen' on black also provides excellent contrast, suitable for buttons and badges. The 'secondaryForeground' white on 'secondary' blue background meets WCAG AA standards for text. The 'accentPeach' on blue background should be used for non-critical elements or icons to maintain sufficient contrast. Overall, the palette supports strong accessibility compliance for text and interactive elements."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "rubik-v2",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "work-sans-v2",
              "open sans",
              "poppins-v2"
            ],
            "headingsUsageGuide": "Use the heading font in large sizes with bold weight to create impactful titles and section headers. Mix white and 'accentNeonGreen' colors to highlight key words or phrases, enhancing visual hierarchy. Pair headings with paragraph fonts by maintaining clear spacing and contrast. Ensure headings remain legible on dark backgrounds by using 'primaryForeground' or 'accentNeonGreen' colors. Avoid overly condensed or decorative styles to preserve clarity.",
            "headingsAccessibilityNotes": "Headings in 'primaryForeground' white or 'accentNeonGreen' on 'primary' black background meet WCAG AAA contrast standards, ensuring excellent readability for all users."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "rubik-v2",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "work-sans-v2",
              "open sans",
              "poppins-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font in regular weight and moderate sizes for body text, descriptions, and navigation links. Maintain high contrast by using 'primaryForeground' white on 'primary' black or 'secondary' blue backgrounds. Ensure sufficient line height and letter spacing for comfortable reading. Pair paragraphs with bold headings to create clear content hierarchy. Avoid using accent colors for large blocks of text to maintain readability.",
            "paragraphsAccessibilityNotes": "Paragraph text in 'primaryForeground' white on 'primary' black or 'secondary' blue backgrounds meets WCAG AA or higher contrast standards, supporting accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Centered",
            "implementation": "The welcome section uses a large, bold heading centered horizontally and vertically within the viewport. The heading text is split with a mix of 'primaryForeground' white and 'accentNeonGreen' colors to emphasize key words. Supporting text is placed below the heading in smaller white font, maintaining strong contrast. Interactive badges and date tags are positioned near the heading with rounded shapes and neon green backgrounds, reinforcing the futuristic theme. The overall typographic placement creates a strong focal point that immediately communicates the event's identity."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "800"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "900"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Text-Focused",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers have rounded corners with solid backgrounds in black, neon green, blue, or peach depending on context. They maintain consistent padding and spacing, creating modular blocks that organize content clearly. The use of bright accent backgrounds for interactive or navigational containers draws user attention effectively.",
          "images": "Images are minimal or abstract, often replaced by graphic elements or logos. When present, images are framed within rounded containers or circular shapes to maintain design consistency.",
          "buttons": "Buttons are rounded with solid backgrounds in 'accentNeonGreen' or outlined in white. Text on buttons is white or black depending on background for maximum contrast. Buttons have clear hover states and are sized for easy interaction."
        },
        "graphicElements": {
          "icons": "Icons are simple, modern, and use the 'accentNeonGreen' color to stand out against dark backgrounds. They have rounded shapes consistent with the overall design language and are used sparingly to support navigation and calls to action.",
          "illustrations": "No prominent illustrations are used; the design relies on abstract shapes and logos to convey brand identity.",
          "stickers": "Badges and stickers use rounded pill shapes with 'accentNeonGreen' backgrounds and black text, providing clear, friendly labels for event types and dates."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750335929106-Screenshot%202025-06-05%20at%2015.42.54%201.png"
      ]
    },
    {
      "presetId": "2921b2fc-2018-4f9e-bcc8-840008408858",
      "brandIdentity": {
        "designSummary": "This design features a sleek, modern aesthetic with a dark, immersive background that sets a serious and professional tone. The color palette is dominated by a deep teal background, contrasted with bright lime green and vibrant purple accents that highlight calls to action and key interface elements. Typography is clean and geometric, using a sans-serif font that balances readability with a contemporary feel. The layout is spacious and modular, with clear alignment and generous padding that enhances usability and visual hierarchy. Abstract translucent shapes and subtle gradients add depth and a futuristic touch without overwhelming the content. Buttons and icons are minimalistic with rounded corners, reinforcing a friendly yet professional interface. Overall, the design communicates innovation, security, and clarity, making it highly adaptable for technology, cybersecurity, or SaaS websites.",
        "toneOfVoice": "Professional, trustworthy, innovative, and approachable with a modern tech-savvy personality.",
        "tones": [
          "Professional",
          "Trustworthy",
          "Innovative",
          "Modern",
          "Clean",
          "Minimalistic",
          "Futuristic",
          "Approachable",
          "Focused",
          "Engaging"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modern Tech",
            "Futuristic"
          ],
          "supportingStyles": [
            "Geometric",
            "Flat Design",
            "Abstract"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#0D3B47",
            "primaryForeground": "#FFFFFF",
            "secondary": "#B9E54F",
            "secondaryForeground": "#0D3B47",
            "background": "#0D3B47",
            "customColors": [
              {
                "name": "brandaccent",
                "value": "#6B5DD3"
              },
              {
                "name": "buttonbackground",
                "value": "#B9E54F"
              },
              {
                "name": "foreground",
                "value": "#FFFFFF"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color as the main background to create a deep, immersive environment that conveys professionalism and security. The 'primaryForeground' color should be used for all primary text to ensure maximum readability against the dark background. The 'secondary' color serves as the main accent for call-to-action buttons, highlights, and important interactive elements, paired with 'secondaryForeground' for text on these elements to maintain contrast. The 'brandAccent' color is ideal for secondary buttons, subtle graphic elements, and hover states to add visual interest without overwhelming the user. Maintain high contrast between text and backgrounds to ensure accessibility. Use the 'buttonBackground' color for primary buttons, ensuring it stands out clearly against the 'primary' background. Avoid overusing bright accent colors to preserve the minimalistic and professional tone.",
          "paletteAccessibilityNotes": "The combination of 'primaryForeground' on 'primary' background meets WCAG AA standards for large and normal text, ensuring readability. The 'secondaryForeground' on 'secondary' background also meets WCAG AA contrast requirements for buttons and interactive elements. The 'brandAccent' used on 'primary' background provides sufficient contrast for secondary buttons and graphic elements. Overall, the palette supports accessible text and UI elements for users with visual impairments."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "questrial",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "rubik-v2",
              "work-sans-v2",
              "open sans"
            ],
            "headingsUsageGuide": "Use the heading font in large sizes with the 'secondary' color to draw attention to key messages and calls to action. Headings should have ample spacing above and below to maintain clarity and hierarchy. Pair headings with paragraph fonts in 'primaryForeground' to maintain contrast and readability. Avoid overly tight letter spacing to preserve legibility.",
            "headingsAccessibilityNotes": "Headings in 'secondary' color on 'primary' background meet WCAG AA contrast standards, ensuring they are easily readable for all users."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "proxima-n-w01-reg",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "open sans",
              "work-sans-v2",
              "rubik-v2"
            ],
            "paragraphsUsageGuide": "Use paragraph fonts in 'primaryForeground' or white on the 'primary' background for maximum readability. Maintain consistent line height and letter spacing to enhance legibility. Paragraph text should be smaller than headings but large enough for comfortable reading on all devices. Use paragraphs to support headings and provide clear, concise information.",
            "paragraphsAccessibilityNotes": "Paragraph text in 'primaryForeground' on 'primary' background meets WCAG AA contrast requirements for body text, ensuring accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Centered",
            "implementation": "The welcome section uses a centered typographic placement with large, bold headings in the 'secondary' color to immediately capture attention. The text is horizontally and vertically centered within the hero area, balanced by abstract translucent shapes in the background. This placement creates a focal point that draws the user's eye directly to the key message, supported by a clear call-to-action button below. The spacing around the text is generous, ensuring the message stands out without distraction."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.015em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.01em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "0em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.01em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.02em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Text-Focused",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid 'primary' background color with generous padding and rounded corners in some cases. They maintain clear separation between sections with consistent margins and subtle shadows or overlays to add depth without clutter. Accent colors highlight container headers or important UI elements.",
          "images": "Images are used sparingly and often integrated with abstract graphic elements. They have clean edges and are balanced with ample negative space. Images do not dominate but support the textual content and brand message.",
          "buttons": "Buttons are rectangular with rounded corners, using 'buttonBackground' for primary actions. Text on buttons uses 'secondaryForeground' for contrast. Buttons have subtle hover effects that slightly brighten the background color to indicate interactivity."
        },
        "graphicElements": {
          "icons": "Icons are minimalistic, flat, and monochromatic, primarily using 'primaryForeground' or 'secondary' colors. They maintain a consistent stroke width and geometric style to align with the overall modern aesthetic.",
          "illustrations": "Illustrations are abstract, using translucent overlapping shapes with gradients in 'brandAccent' and shades of gray. They add depth and a futuristic feel without distracting from the content.",
          "stickers": "No explicit stickers or badges are present; if used, they should be minimal and use 'secondary' or 'brandAccent' colors to maintain brand consistency."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750922846623-Screenshot%202025-06-03%20at%2014.36.39.jpg"
      ]
    },
    {
      "presetId": "55446e0b-301c-4baf-a667-b23f087ad0ed",
      "brandIdentity": {
        "designSummary": "This design embodies a refined, elegant aesthetic with a focus on natural history and cultural sophistication. It employs a restrained, earthy color palette dominated by dark brown and light beige backgrounds, accented with muted olive green and warm terracotta tones. The typography combines a high-contrast serif font for headings, lending a timeless and editorial feel, with a clean, modern sans-serif for body text to ensure readability and approachability. The layout is spacious and balanced, featuring asymmetrical grids and generous negative space that highlight imagery and textual content without clutter. Graphic elements such as line-based icons and minimalistic isometric illustrations complement the overall understated and professional tone, making the design suitable for educational or museum contexts. The color usage and typography choices work harmoniously to create a calm, authoritative, and inviting user experience.",
        "toneOfVoice": "Sophisticated, authoritative, calm, and inviting with a cultured and educational personality.",
        "tones": [
          "calm",
          "sophisticated",
          "authoritative",
          "inviting",
          "refined",
          "natural",
          "educational",
          "minimal",
          "warm",
          "balanced"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Editorial",
            "Modern Classic"
          ],
          "supportingStyles": [
            "Naturalistic",
            "Isometric Illustration",
            "Line Art"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#2E241F",
            "primaryForeground": "#F5F1E9",
            "secondary": "#B94A2A",
            "secondaryForeground": "#F5F1E9",
            "background": "#F5F1E9",
            "customColors": [
              {
                "name": "mutedolive",
                "value": "#8A8B5E"
              },
              {
                "name": "darktext",
                "value": "#1C1A17"
              },
              {
                "name": "subtleborder",
                "value": "#D3CFC6"
              },
              {
                "name": "foreground",
                "value": "#2E241F"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color predominantly for large background areas in hero sections and key UI elements to establish a strong, grounded presence. Text on 'primary' backgrounds should be in 'primaryForeground' to ensure high contrast and readability. The 'secondary' color is ideal for call-to-action buttons, links, and highlights, paired with 'secondaryForeground' for text to maintain clarity. The 'background' color serves as the main canvas for content areas, providing a light, neutral base that supports legibility and visual comfort. 'MutedOlive' is best used as a subtle background accent behind images or sections to add natural warmth without overpowering. 'DarkText' is reserved for body text and navigation to ensure crisp readability on light backgrounds. 'SubtleBorder' can be applied to delineate sections or UI boundaries gently without harsh contrast. This palette balances warmth and neutrality, supporting an inviting yet authoritative brand presence.",
          "paletteAccessibilityNotes": "The 'primaryForeground' on 'primary' background achieves WCAG AA and AAA contrast ratios for large and normal text, ensuring accessibility. The 'secondaryForeground' on 'secondary' background also meets WCAG AA standards for buttons and interactive elements. 'DarkText' on 'background' provides excellent contrast for body text, surpassing WCAG AAA requirements. 'MutedOlive' used as a background accent maintains sufficient contrast with 'primaryForeground' text when applied carefully. Borders using 'subtleBorder' are subtle and do not interfere with text readability. Overall, the palette supports accessible typography and UI components across the site."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "baskervillemtw01-smbdit",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "baskervillemtw01-smbdit",
              "didot-w01-italic"
            ],
            "headingsUsageGuide": "Use the heading font for all primary titles and section headers to convey sophistication and timelessness. Pair with the sans-serif body font to create a clear typographic hierarchy. Maintain ample spacing around headings to preserve their impact and legibility. Use 'primary' or 'darkText' colors for headings on light backgrounds, and 'primaryForeground' on dark backgrounds to ensure contrast. Avoid using this font for body text to maintain readability.",
            "headingsAccessibilityNotes": "Headings in 'darkText' on 'background' and 'primaryForeground' on 'primary' backgrounds meet WCAG AA contrast standards for all sizes, ensuring accessibility and clarity."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "open sans",
              "nunito sans",
              "raleway"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, captions, and navigation links to ensure clarity and ease of reading. Combine with the serif heading font to balance elegance with approachability. Text color should primarily be 'darkText' on 'background' for optimal contrast. Maintain consistent line height and spacing to enhance legibility. Use 'secondary' color sparingly for links or emphasis within paragraphs.",
            "paragraphsAccessibilityNotes": "Body text in 'darkText' on 'background' exceeds WCAG AAA contrast requirements, supporting excellent readability for all users."
          },
          "welcomeSectionTypography": {
            "placement": "Centered",
            "implementation": "The welcome section uses a large, centered heading with the serif font to create an immediate visual impact. The heading is placed prominently in the vertical and horizontal center of the hero area, surrounded by ample negative space and balanced by smaller images arranged asymmetrically around it. This placement draws the eye directly to the brand message, supported by subtle background color contrasts and minimal navigation elements to avoid distraction."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.03em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.04em",
              "fontWeight": "800"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.05em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.06em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Moderate Contrast",
            "gridAlignmentSpectrum": "Asymmetrical Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Asymmetrical with modular elements",
            "spacing": {
              "columns": "Flexible 12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use light background colors with subtle borders in 'subtleBorder' to separate content areas. They maintain generous padding and margin to preserve the spacious feel. Dark text in 'darkText' ensures readability within containers.",
          "images": "Images are framed with ample negative space and occasionally backed by 'mutedOlive' or 'background' blocks to highlight them without overwhelming the layout. They maintain natural proportions and are integrated asymmetrically for visual interest.",
          "buttons": "Buttons use the 'secondary' color for backgrounds with 'secondaryForeground' text for strong call-to-action emphasis. Outlined buttons use 'secondary' borders with transparent backgrounds and 'secondary' text. Hover states invert these colors for interactivity."
        },
        "graphicElements": {
          "icons": "Icons are minimal, line-based, and monochromatic, primarily using 'darkText' or 'primaryForeground' colors. They maintain a clean and modern look consistent with the overall design.",
          "illustrations": "Illustrations, such as the isometric map, use monochromatic line art in 'primary' and 'darkText' colors with minimal shading, reinforcing the educational and refined tone.",
          "stickers": "No prominent stickers or badges are used, maintaining the clean and sophisticated aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752422070224-Hero%20150.jpg"
      ]
    }
  ],
  "brandBook": {
    "tones": [
      "calm",
      "trustworthy",
      "professional",
      "clean",
      "modern",
      "approachable",
      "efficient",
      "minimal",
      "friendly",
      "balanced"
    ],
    "designStyle": {
      "primaryStyle": [
        "Minimalism",
        "Modernism"
      ],
      "supportingStyles": [
        "Flat Design",
        "Geometric"
      ]
    },
    "toneOfVoice": "Professional, approachable, clear, and trustworthy with a calm and efficient personality.",
    "components": {
      "images": "Images are used sparingly and are well-integrated with text content, often aligned to the right or left of text blocks. They maintain natural proportions and are framed with generous white space to avoid clutter. Image treatments are minimal, focusing on clarity and relevance.",
      "buttons": "Buttons are solid with rounded corners, primarily using the 'primary' color for backgrounds and 'primaryForeground' for text. Secondary buttons use lighter backgrounds with 'secondary' color text and borders. Buttons have clear hover states and sufficient padding for easy interaction.",
      "containers": "Containers use subtle rounded corners and light backgrounds with gentle shadows or borders to separate content blocks. They maintain consistent padding and spacing to preserve the clean and spacious feel. Background colors often use 'background' or custom pastel accents to differentiate sections without overwhelming the user."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "Primary Heading Font",
          "fontFamily": "helvetica-w01-bold",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Use the heading font for all major titles and section headers to establish clear content hierarchy. Headings should be large and bold with ample spacing to enhance readability and visual impact. Pair headings with the paragraph font to create a balanced typographic rhythm. Ensure headings use the 'primary' color for maximum contrast against the 'background'. Maintain consistent letter spacing and line height to preserve clarity across devices and screen sizes.",
        "headingsSimilarFonts": [
          "rubik-v2",
          "poppins-v2",
          "open sans"
        ],
        "headingsAccessibilityNotes": "Headings in 'primary' color on 'background' meet WCAG AAA contrast standards, ensuring excellent readability for all users."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.25",
          "fontWeight": "400"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.015em",
          "lineHeight": "1.35",
          "fontWeight": "400"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.005em",
          "lineHeight": "1.5",
          "fontWeight": "500"
        },
        {
          "name": "xl",
          "size": "1.25rem",
          "letterSpacing": "0em",
          "lineHeight": "1.5",
          "fontWeight": "600"
        },
        {
          "name": "2xl",
          "size": "1.5rem",
          "letterSpacing": "-0.005em",
          "lineHeight": "1.4",
          "fontWeight": "700"
        },
        {
          "name": "3xl",
          "size": "1.875rem",
          "letterSpacing": "-0.01em",
          "lineHeight": "1.3",
          "fontWeight": "700"
        },
        {
          "name": "4xl",
          "size": "2.25rem",
          "letterSpacing": "-0.015em",
          "lineHeight": "1.2",
          "fontWeight": "800"
        },
        {
          "name": "5xl",
          "size": "3rem",
          "letterSpacing": "-0.02em",
          "lineHeight": "1.1",
          "fontWeight": "800"
        },
        {
          "name": "6xl",
          "size": "3.75rem",
          "letterSpacing": "-0.025em",
          "lineHeight": "1.1",
          "fontWeight": "900"
        },
        {
          "name": "7xl",
          "size": "4.5rem",
          "letterSpacing": "-0.03em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "8xl",
          "size": "6rem",
          "letterSpacing": "-0.035em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "-0.04em",
          "lineHeight": "1",
          "fontWeight": "900"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "Main Body Text Font",
          "fontFamily": "helvetica-w01-roman",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Use the paragraph font for all body copy, descriptions, and supporting text. Maintain a lighter font weight and moderate size to ensure comfortable reading. Paragraph text should use the 'primary' color or a slightly lighter shade if needed for secondary information, always ensuring sufficient contrast with the 'background'. Combine with headings to create a clear typographic hierarchy and consistent user experience. Line height and letter spacing should be optimized for legibility on all screen sizes.",
        "paragraphsSimilarFonts": [
          "rubik-v2",
          "open sans",
          "poppins-v2"
        ],
        "paragraphsAccessibilityNotes": "Paragraph text in 'primary' color on 'background' meets WCAG AA contrast requirements for normal text, supporting accessibility and readability."
      },
      "welcomeSectionTypography": {
        "placement": "Bottom-Third Anchor",
        "implementation": "The welcome section typography is anchored in the bottom third of the layout, creating a grounded and approachable introduction. Large, bold headings occupy the lower left quadrant, balanced by supporting text and call-to-action buttons placed nearby with ample negative space. This placement draws the eye naturally from the headline to the action, leveraging the spacious layout and clean typography to create a welcoming and clear entry point for users."
      }
    },
    "originImagesUrls": [
      "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752409506686-Screenshot%202025-07-13%20at%2015.24.32.png"
    ],
    "layout": {
      "grid": {
        "margins": "Generous page margins",
        "padding": "Consistent padding within containers",
        "spacing": {
          "gaps": "Consistent medium gaps",
          "rows": "Defined content rows",
          "columns": "12-column grid"
        },
        "compositionApproach": "Column-based"
      },
      "layoutDna": {
        "contrastSpectrum": "High-Contrast",
        "densitySpectrum": "Balanced",
        "textVsImageEmphasis": "Balanced",
        "complexitySpectrum": "Simple & Clean",
        "gridAlignmentSpectrum": "Modular",
        "negativeSpaceUsage": "Generous"
      }
    },
    "graphicElements": {
      "icons": "Icons are minimalistic, line-based, and use the 'primary' or 'secondary' colors depending on context. They are small, simple, and consistent in style, supporting content without distraction.",
      "stickers": "Stickers or badges are small, color-coded UI elements using 'softYellowAccent' or 'lightPurpleAccent' to categorize or highlight content. They have rounded corners and subtle shadows to stand out gently.",
      "illustrations": "Illustrations are minimal or absent in the UI, with the design favoring photographic or video content where applicable. When present, they use the custom pastel colors to maintain harmony."
    },
    "designSummary": "This brand design embraces a minimalist and modern aesthetic characterized by spacious layouts, clean typography, and a restrained pastel color palette. The primary background colors are soft off-whites and pale blues, creating a calm and inviting canvas. Text and interactive elements predominantly use a deep navy blue, ensuring strong contrast and readability. Accent colors in subtle pastel purple and yellow appear in small UI elements, adding gentle vibrancy without overwhelming the design. Typography is geometric sans-serif, with large, bold headings paired with lighter, well-spaced body text to enhance clarity and hierarchy. The layout employs modular grids with generous negative space, balancing text and iconography in a harmonious, user-friendly manner. Buttons are solid, rounded rectangles with dark backgrounds and white text, emphasizing clear calls to action. Overall, the design conveys professionalism, approachability, and efficiency, making it highly adaptable for educational platforms, professional services, and technology brands seeking a clean and trustworthy online presence.",
    "palette": {
      "colors": {
        "background": "#F7F9FF",
        "secondary": "#A59FE6",
        "customColors": [
          {
            "name": "softyellowaccent",
            "value": "#FFF9B1"
          },
          {
            "name": "foreground",
            "value": "#1E254E"
          },
          {
            "name": "destructive",
            "value": "#DF3131"
          },
          {
            "name": "destructiveforeground",
            "value": "#FFFFFF"
          }
        ],
        "secondaryForeground": "#1E254E",
        "primaryForeground": "#F7F9FF",
        "primary": "#1E254E"
      },
      "paletteUsageGuide": "Use the 'background' color as the primary canvas for all pages to maintain a clean and calm atmosphere. The 'primary' color should be reserved for main text, headings, and key interactive elements such as buttons and links, paired with 'primaryForeground' for text on these elements to ensure readability. The 'secondary' color and its 'secondaryForeground' are ideal for subtle UI accents, secondary buttons, and category tags, providing gentle contrast without overpowering the primary content. Custom colors like 'softYellowAccent' and 'lightPurpleAccent' are best used sparingly for highlighting informational badges, icons, or subtle background gradients to add visual interest while preserving the minimalist tone. This palette ensures accessibility and visual harmony, supporting a professional and approachable brand presence.",
      "paletteAccessibilityNotes": "The 'primary' color (#1E254E) on 'background' (#F7F9FF) achieves excellent contrast exceeding WCAG AA standards for both normal and large text. Buttons using 'primary' with 'primaryForeground' (#FFFFFF) also meet AAA contrast requirements. The 'secondary' color (#A59FE6) on 'background' provides sufficient contrast for UI accents and secondary text, meeting WCAG AA for large text. Custom colors 'softYellowAccent' and 'lightPurpleAccent' are used in small UI elements and backgrounds where contrast requirements are less stringent but should be paired with 'primary' or 'primaryForeground' text to maintain readability and accessibility compliance."
    }
  },
  "initialPrompt": "Create a website inspired by Upwork, with the following additional features: 1. Transparent Hybrid Pricing Model: Freelancers can choose between subscription tiers, low flat fees, or commission-based models. 2. Advanced Multi-Layer Verification: Includes KYC, skill assessment tests, portfolio authenticity analysis, proctored coding/design challenges, and credential badges for a credibility-based ranking system. 3. Integrated Real-Time Communication Suite: Audio/video calls, collaborative whiteboard, code sandbox, and preview session rooms. 4. AI-Assisted Scoping and Matching: AI transforms job posts into structured requirements, recommends freelancers, and helps create milestones and timelines. 5. Portable Reputation Ledger: Freelancers can export their reviews, scores, and verified achievements. 6. Modular Escrow and Instant Payout Options: Milestone-based escrow with instant payout options for freelancers. 7. Comprehensive Client Metrics: Client ratings for reliability, fairness, payment punctuality, and dispute frequency, with freelancer filtering. System architecture: Microservice-based, scalable, with web/mobile frontend, real-time collaboration, AI proposal builder, secure payments, analytics, and GDPR-compliant data management.",
  "status": "READY",
  "revision": "13",
  "createdDate": "2025-11-18T12:06:49.387Z",
  "updatedDate": "2025-11-18T12:08:08.052Z",
  "attachments": {
    "contentImagesUrls": [],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "732f99d8-433f-4288-a5ed-4d4fab83a0dd",
  "plan": "{\n  \"sections\": [\n    {\n      \"id\": \"overview\",\n      \"title\": \"## Overview\",\n      \"content\": \"This plan outlines the creation of a sophisticated freelance marketplace platform, inspired by Upwork, featuring advanced verification, real-time communication, AI-assisted job management, and a portable reputation system. The platform will support diverse pricing models and robust client/freelancer metrics.\"\n    },\n    {\n      \"id\": \"key-features\",\n      \"title\": \"## Key features\",\n      \"content\": \"- **View Freelancer Listing**: Displays a list of available freelancers.\\n- **View Freelancer Details**: Shows detailed profiles, including verified credentials, skills, and portfolio.\\n- **View Job Listing**: Displays available job postings.\\n- **View Job Details**: Shows detailed information for a specific job post.\\n- **Submit Job Post**: Allows clients to create and submit new job requirements.\\n- **Submit Proposal**: Allows freelancers to apply for jobs.\\n- **Initiate Communication**: Enables real-time audio/video calls and chat between clients and freelancers.\\n- **Use Collaborative Tools**: Access shared whiteboards and code sandboxes for project collaboration.\\n- **Manage Milestones**: Create, track, and manage project milestones.\\n- **Process Payments**: Facilitates secure payment transactions, including escrow and instant payout options.\\n- **View Client Metrics**: Displays client ratings and performance indicators.\\n- **Manage Freelancer Reputation**: Allows freelancers to export their verified achievements and reviews.\",\n      \"metadata\": [\n        { \"id\": \"view-freelancer-listing\", \"name\": \"View Freelancer Listing\" },\n        { \"id\": \"view-freelancer-details\", \"name\": \"View Freelancer Details\" },\n        { \"id\": \"view-job-listing\", \"name\": \"View Job Listing\" },\n        { \"id\": \"view-job-details\", \"name\": \"View Job Details\" },\n        { \"id\": \"submit-job-post\", \"name\": \"Submit Job Post\" },\n        { \"id\": \"submit-proposal\", \"name\": \"Submit Proposal\" },\n        { \"id\": \"initiate-communication\", \"name\": \"Initiate Communication\" },\n        { \"id\": \"use-collaborative-tools\", \"name\": \"Use Collaborative Tools\" },\n        { \"id\": \"manage-milestones\", \"name\": \"Manage Milestones\" },\n        { \"id\": \"process-payments\", \"name\": \"Process Payments\" },\n        { \"id\": \"view-client-metrics\", \"name\": \"View Client Metrics\" },\n        { \"id\": \"manage-freelancer-reputation\", \"name\": \"Manage Freelancer Reputation\" }\n      ]\n    },\n    {\n      \"id\": \"structure\",\n      \"title\": \"## Structure\",\n      \"content\": \"- **Homepage**: Serves as the entry point, potentially showcasing featured freelancers, jobs, and platform benefits.\\n- **Freelancer Directory**: Hosts the listing and detailed profiles of freelancers.\\n- **Job Board**: Displays available job listings and allows clients to post new jobs.\\n- **Project Workspace**: A central hub for active projects, including communication tools, milestone management, and payment processing.\\n- **Reputation & Metrics Page**: Displays client metrics and allows freelancers to manage their portable reputation ledger.\"\n    }\n  ],\n  \"apps\": [\n    {\n      \"id\": \"wix-cms\",\n      \"keyFeatures\": [\n        { \"id\": \"view-freelancer-listing\", \"name\": \"View Freelancer Listing\" },\n        { \"id\": \"view-freelancer-details\", \"name\": \"View Freelancer Details\" },\n        { \"id\": \"view-job-listing\", \"name\": \"View Job Listing\" },\n        { \"id\": \"view-job-details\", \"name\": \"View Job Details\" },\n        { \"id\": \"submit-job-post\", \"name\": \"Submit Job Post\" },\n        { \"id\": \"submit-proposal\", \"name\": \"Submit Proposal\" },\n        { \"id\": \"initiate-communication\", \"name\": \"Initiate Communication\" },\n        { \"id\": \"use-collaborative-tools\", \"name\": \"Use Collaborative Tools\" },\n        { \"id\": \"manage-milestones\", \"name\": \"Manage Milestones\" },\n        { \"id\": \"process-payments\", \"name\": \"Process Payments\" },\n        { \"id\": \"view-client-metrics\", \"name\": \"View Client Metrics\" },\n        { \"id\": \"manage-freelancer-reputation\", \"name\": \"Manage Freelancer Reputation\" }\n      ]\n    }\n  ],\n  \"version\": \"2.5\"\n}",
  "designerData": {
    "designerId": "59076a1d-61da-4711-8035-592d26c5d5fe",
    "designerName": "Linus",
    "selectionMethod": "UNSELECTED"
  }
}